package consts;
//游戏玩法
public enum  GameType {
//    金牛：三位数相同/20倍
//    顺子：/15
//    双尾：后两位相同899最大100最小12/
//    点数：比最后两位数，最大10其中就都一样比最大的数，
//    最比前面一位数/10
//
//
//
//    金花：
//    三位数相同/20
//    顺子/15
//    后两位相同899最大100最小/12
//    点数：比最后一位数，如果一样依次比，最后同样就算《平》/10
//
//
//    疯牛：
//    三位数相同/15
//            900/800..../100小/15
//    点数：比最后两位数，最大10其中就都一样比最大的数，
//    最比前面一位数/10
//
//
//    普牛：
//    三位数相同/6
//            900/800..../100小/5
//    三位数相加如果一样就依次比前面那一位，
//            1-6/1
//            7-8/2
//            9
//
//    双开：
//    三位数相同
//            顺子=900/800..../100小=平
//            对子


    TYPE_ONE,
    TYPE_TWO,
    TYPE_THREE,
    TYPE_FOUR,
    TYPE_FIVE,


    GameType()
}
